Repository: CofficLab/GitOK
Catalog: Packages/KitGit/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: This directory is not a Git repository: %@
zh_hans: 该目录不是 Git 仓库：%@
zh_hk: 該目錄不是 Git 儲存庫：%@

source: Git command not found. Please make sure git is installed.
zh_hans: 未找到 git 命令，请确认系统已安装 git
zh_hk: 找不到 git 指令，請確認系統已安裝 git

source: There are no changes to commit in the current workspace.
zh_hans: 当前工作区没有可提交的改动。
zh_hk: 目前工作區沒有可提交的變更。

source: Commit failed: %@
zh_hans: 提交失败：%@
zh_hk: 提交失敗：%@

source: Push failed: %@
zh_hans: 推送失败：%@
zh_hk: 推送失敗：%@

source: A commit is required to revert.
zh_hans: 需要指定要反转的提交。
zh_hk: 需要指定要反轉的提交。

source: Revert failed: %@
zh_hans: 反转提交失败：%@
zh_hk: 反轉提交失敗：%@

source: Undo failed: %@
zh_hans: 撤销提交失败：%@
zh_hk: 撤銷提交失敗：%@

source: The working tree must be clean before undoing a commit.
zh_hans: 撤销提交前工作区必须干净。
zh_hk: 撤銷提交前工作區必須乾淨。

source: The selected commit is no longer the current HEAD.
zh_hans: 选中的提交已不是当前 HEAD。
zh_hk: 選取的提交已不是目前 HEAD。

source: Soft reset failed: %@
zh_hans: 软重置失败：%@
zh_hk: 軟重置失敗：%@

source: Mixed reset failed: %@
zh_hans: 混合重置失败：%@
zh_hk: 混合重置失敗：%@

source: Hard reset failed: %@
zh_hans: 硬重置失败：%@
zh_hk: 硬重置失敗：%@

source: Squash failed: %@
zh_hans: 压缩提交失败：%@
zh_hk: 壓縮提交失敗：%@

source: The working tree must be clean before squashing commits.
zh_hans: 压缩提交前工作区必须干净。
zh_hk: 壓縮提交前工作區必須乾淨。

source: The current HEAD changed before the squash could start.
zh_hans: 压缩开始前当前 HEAD 已发生变化。
zh_hk: 壓縮開始前目前 HEAD 已發生變化。

source: The working tree must be clean before resetting history.
zh_hans: 重置历史前工作区必须干净。
zh_hk: 重置歷史前工作區必須乾淨。

source: The current HEAD changed before the reset could start.
zh_hans: 重置开始前当前 HEAD 已发生变化。
zh_hk: 重置開始前目前 HEAD 已發生變化。

source: A valid tag name is required.
zh_hans: 需要有效的标签名称。
zh_hk: 需要有效的標籤名稱。

source: A commit is required for the tag.
zh_hans: 创建标签需要指定提交。
zh_hk: 建立標籤需要指定提交。

source: An annotated tag message is required.
zh_hans: 附注标签需要填写说明。
zh_hk: 附註標籤需要填寫說明。

source: A remote name is required for the tag.
zh_hans: 操作远程标签需要指定远程仓库。
zh_hk: 操作遠端標籤需要指定遠端儲存庫。

source: Tag creation failed: %@
zh_hans: 创建标签失败：%@
zh_hk: 建立標籤失敗：%@

source: Tag deletion failed: %@
zh_hans: 删除标签失败：%@
zh_hk: 刪除標籤失敗：%@

source: Tag push failed: %@
zh_hans: 推送标签失败：%@
zh_hk: 推送標籤失敗：%@

source: Remote tag deletion failed: %@
zh_hans: 删除远程标签失败：%@
zh_hk: 刪除遠端標籤失敗：%@

source: A valid branch name is required.
zh_hans: 需要有效的分支名称。
zh_hk: 需要有效的分支名稱。

source: A remote name is required.
zh_hans: 需要指定远程仓库名称。
zh_hk: 需要指定遠端儲存庫名稱。

source: The remote HEAD branch cannot be deleted.
zh_hans: 不能删除远程 HEAD 分支。
zh_hk: 不能刪除遠端 HEAD 分支。

source: Branch rename failed: %@
zh_hans: 重命名分支失败：%@
zh_hk: 重新命名分支失敗：%@

source: Upstream update failed: %@
zh_hans: 更新上游失败：%@
zh_hk: 更新上游失敗：%@

source: Branch publish failed: %@
zh_hans: 发布分支失败：%@
zh_hk: 發佈分支失敗：%@

source: Remote branch deletion failed: %@
zh_hans: 删除远程分支失败：%@
zh_hk: 刪除遠端分支失敗：%@

source: Two branches are required for comparison.
zh_hans: 比较需要指定两个不同的分支。
zh_hk: 比較需要指定兩個不同的分支。

source: Branch comparison failed: %@
zh_hans: 分支比较失败：%@
zh_hk: 分支比較失敗：%@

source: Git unavailable: %@
zh_hans: Git 不可用：%@
zh_hk: Git 不可用：%@
